/* 
  PopUpHelp.strings
  View Studio

  Created by Pauli Ojala on 04/03/14.
  Copyright (c) 2014 Neonto. All rights reserved.
*/

"Doc::AddMenu::header" = "How to use a menu";
"Doc::AddMenu::message" = "You've created a new menu. This type of block is useful for navigation and displaying lists of items.\n\nDouble-click the new Menu block to edit it.\n\nBy default, the menu is configured as full screen. You can change this in the menu's settings. The other type of menu is called a 'tab bar', it's a horizontal bar that allows you to switch between multiple screens.";
"Doc::AddMenu::button1.title" = "Web Documentation";
"Doc::AddMenu::button1.targetHelpTopic" = "";

"Doc::AddSequence::header" = "How to use a storyline";
"Doc::AddSequence::message" = "You've created a new storyline. This type of block can contain multiple pages which the user can browse through in order. These pages are called 'storypoints'.\n\nFor any element you place in a storyline, you can decide whether its contents should change or remain constant over the storypoints.\n\nDouble-click the new Storyline block to edit it.";
"Doc::AddSequence::button1.title" = "Web Documentation";
"Doc::AddSequence::button1.targetHelpTopic" = "";

"SequenceView::OpenMenu::header" = "Editing a menu";
"SequenceView::OpenMenu::message" = "This is the main design view. At the top, you have the Viewer and the Device Previews. Below are the Elements view and the Element Types box.\n\nTo create a new element, drag from the box in the bottom-right corner. To draw some graphics or text, use the tools to the left of the Viewer area.";
"SequenceView::OpenMenu::button1.title" = "Web Documentation";
"SequenceView::OpenMenu::button1.targetHelpTopic" = "";

"SequenceView::OpenSequence::header" = "Editing a storyline";
"SequenceView::OpenSequence::message" = "This is the main design view. At the top, you have the Viewer and the Device Previews. Below are the Elements view and the Element Types box.\n\nStorylines are special because the Elements view works like a movie timeline: any element can span multiple storypoints, and this automatically creates pages that the user can flick through.\n\nTo create storypoints in this storyline, create an element, then select it and change its Duration value. Then you can browse through the storypoints using the Prev/Next buttons.";
"SequenceView::OpenSequence::button1.title" = "Web Documentation";
"SequenceView::OpenSequence::button1.targetHelpTopic" = "";

"Inspector::AppRoot::header" = "The app settings";
"Inspector::AppRoot::message" = "This block represents the app you're creating. Some important settings are located here. 'First launch' determines where your app starts up.\n\nIn 'Supported displays', you should select the device sizes and display orientations that you want your app to support (for example, for a phone app you may only want to support portrait mode).\n\nThere are also app-wide colors that you can modify. These are useful for styling your graphics and buttons in a uniform way.";
"Inspector::AppRoot::button1.title" = "Web Documentation";
"Inspector::AppRoot::button1.targetHelpTopic" = "";
